finger563/esp-usb-ble-hid/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

# Partition Table (nvs + otadata + two OTA app slots + coredump)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# OTA: a freshly updated image boots PENDING_VERIFY and is rolled back on the
# next reset unless the host confirms it from the dongle console.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

#
# BT config
#
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_LOG_LEVEL_NONE=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=100
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# set the bonding configuration to configure the max number of bonded devices
# that can be remembered.
#
# NOTE: the MAX_CCCDS must be AT LEAST 6 * MAX_BONDS, otherwise the number of
# bonded devices allowed will be limited by the number of CCCDs / 6. The factor
# is determined by the number of notifications and indications that can be
# stored for each bonded device. For this reason, we've set max CCCDs to be very
# large so that they are not the limit.
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_MAX_CCCDS=128

# Set the ESP-NIMBLE-CPP Config
CONFIG_NIMBLE_CPP_LOG_LEVEL_NONE=y

#
# TinyUSB config (espp usb_device: HID gamepad + vendor/WebUSB console stream;
# the CDC class must be compiled in for usb_device even when no CDC function is
# configured -- it is only added to the descriptor with DONGLE_USB_CDC_CONSOLE)
#
CONFIG_TINYUSB_HID_COUNT=1
# the Switch Pro reports are 64 bytes (the default 16 truncates them)
CONFIG_TINYUSB_HID_BUFSIZE=64
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_TINYUSB_VENDOR_RX_BUFSIZE=4096
CONFIG_TINYUSB_VENDOR_TX_BUFSIZE=4096
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_TX_BUFSIZE=4096

# Coredump support (to the coredump partition, ELF format, readable over USB
# from the dongle console)
CONFIG_ESP_COREDUMP_ENABLE=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
